Revit 2024 API
IUpdater.GetUpdaterName Method
 Returns a name that the Updater can be identified by to the user
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
string GetUpdaterName()
Visual Basic
Function GetUpdaterName As String
Visual C++
String^ GetUpdaterName()
See Also
IUpdater Interface
Autodesk.Revit.DB Namespace